backend/app/models/plant.rb

  def species_attributes=(name)
    self.species = Species.find_or_create_by(name: name)
---
INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test species"], ["created_at", "2021-04-14 15:39:43.707569"], ["updated_at", "2021-04-14 15:39:43.707569"]]
SELECT "species".* FROM "species" WHERE "species"."name" = $1 LIMIT $2  [["name", "Test species"], ["LIMIT", 1]]