backend/app/controllers/plants_controller.rb

INSERT INTO "plants" ("name", "notes", "species_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", " test name"], ["notes", "test notes "], ["species_id", 6], ["created_at", "2021-04-14 15:39:44.126879"], ["updated_at", "2021-04-14 15:39:44.126879"]]
---
  def create
    @plant = Plant.new(plant_params)

    if @plant.save

DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 3]]
---
  def destroy
    @plant.destroy